xs2a-payment-support/xs2a-payment-support-impl/src/test/resources/json/support/mapper/xs2a-single-payment.json

{
  "paymentId": "2Cixxv85Or_qoBBh_d7VTZC0M8PwzR5IGzsJuT-jYHNOMR1D7n69vIF46RgFd7Zn_=_bS6p6XvTWI",
  "paymentProduct": "sepa-credit-transfers",
  "creditorAccount": {
    "aspspAccountId": "1234567890",
    "resourceId": "3276159a-27ad-46db-8491-71e629d82baa",
    "currency": "EUR",
    "iban": "DE15500105172295759744",
    "bban": "Test BBAN",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "pan": "1111"
  },
  "creditorAddress": {
    "buildingNumber": "56",
    "townName": "Nürnberg",
    "postCode": "90543",
    "streetName": "WBG Straße",
    "country": {
      "code": "DE"
    }
  },
  "creditorAgent": "BCENECEQ",
  "creditorId": "27ad-46db-8491-71e629d82baa",
  "creditorName": "Telekom",
  "debtorAccount": {
    "aspspAccountId": "1234567890",
    "resourceId": "3276159a-27ad-46db-8491-71e629d82baa",
    "currency": "EUR",
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "pan": "1111"
  },
  "endToEndIdentification": "RI-123456789",
  "instructedAmount": {
    "amount": "1000.00",
    "currency": "EUR"
  },
  "remittanceInformationUnstructured": "Ref. Number TELEKOM-1222",
  "remittanceInformationStructured": "Ref Number Merchant",
  "ultimateCreditor": "ultimateCreditor",
  "ultimateDebtor": "ultimateDebtor",
  "purposeCode": "CDQC",
  "transactionStatus": "ACCP"
}
